{
    "videos": [
        {
            "URL": "https://www.youtube.com/embed/yi_gS9dsXHE?version=3&vq=hd1080",
            "description": "Number 34, equally as good as 33, good clips, good song and a decent extension into the new style."
        }, 
        {
            "URL": "https://www.youtube.com/embed/ZJq5ynCNs8M?version=3&vq=hd1080",
            "description": "Number 33, very good return to form, with revival making the game playable again, and a fresh sprinkle of inspiration letting me finally get away from the whole VHS filter and scratching gimmick. Very happy with this newer, more mid-2010s style I have stumbled upon."
        }, 
        {
            "URL": "https://www.youtube.com/embed/GBiBZC-ve8w?version=3&vq=hd1080",
            "description": "Number 32, no three strikes, a lack of passion and poor headspace combined led to probably the weakest entry in the series, padded out heavily with R5 clips, only a few clips that would be reused for the end of year video. The song is great though."
        }, 
        {
            "URL": "https://www.youtube.com/embed/WyIf1cr2opw?version=3&vq=hd1080",
            "description": "Not a mainline release, but also worthy of being on this page, good collection my R5 clips set to one of my favorite bands."
        }, 
        {
            "URL": "https://www.youtube.com/embed/MFp6suFF_1Y?version=3&vq=hd1080",
            "description": "Number 31, three strikes continues to make getting good clips much easier, very good editing and a slight tone shift towards a more modern style. Similar to #30, I had some help on the thumbnail. Got picked up on a real aim group this time around as well."
        }, 
        {
            "URL": "https://www.youtube.com/embed/o7D-9KaT2fQ?version=3&vq=hd1080",
            "description": "Not a mainline release, but this is a cool VOD review going over the fundamentals in mechanics with a well-known tier 2 pro. Theory wise this is better than the other tutorial, also got quite a lot of views."
        }, 
        {
            "URL": "https://www.youtube.com/embed/Mx3HAIntgNY?version=3&vq=hd1080",
            "description": "End of year 2023, very clean editing, good sequel to #27 which I believe is my best edited video. The sequence starting at 3:12 is probably the best the whole scratching thing is going to get, apologies for bringing the hard VHS filter back one last time."
        }, 
        {
            "URL": "https://www.youtube.com/embed/P6Zxvg85-WQ?version=3&vq=hd1080",
            "description": "Number 30, much better clips due to three strikes being added, also had a great friend helping me out with the intro and thumbnail, many thanks! Was also signed during the making of this video and left the org very soon due to the org failing."
        }, 
        {
            "URL": "https://www.youtube.com/embed/TWnBs-kw_Xk?version=3&vq=hd1080",
            "description": "Number 29, very mediocre clips unfortunately, due to the SBMM changes, had to pad out the video with R5 clips. Also the title is chosen after being frustrated with people not working with me on aimmag."
        }, 
        {
            "URL": "https://www.youtube.com/embed/v-nBHHwylgM?version=3&vq=hd1080",
            "description": "Number 28, first video using a different damage filter, with the goal of making it look like a early 2000s video, something off a VX1000. Love the intro, and all my friends who were a part of it."
        }, 
        {
            "URL": "https://www.youtube.com/embed/WrNqD7bCBOg?version=3&vq=hd1080",
            "description": "Number 27, this one took a lot of time to make since I wanted to sync up the cuts with the scratching in the song, it came out very well and I’m super happy with the results. This will also be the last video using this VHS filter (Edit: I lied.), since I think I’ve been using it for too long and it’s time to move on and find a new way to give my videos the texture I want."
        }, 
        {
            "URL": "https://www.youtube.com/embed/xbcln1ysQVA?version=3&vq=hd1080",
            "description": "Number 26, got very addicted to using the wingman for this video, not much special in the editing side of things, and looking back at it I probably could’ve used a better song. Still, good clips and is up to my own standards."
        },
        {
            "URL": "https://www.youtube.com/embed/TLG32aIXjeQ?version=3&vq=hd1080",
            "description": "Not a frag video, but a guide going over basic 1v1 mechanics in Apex (principles mentioned covers all FPS games), tried to make it “in-universe” with the host (Who was AI, by the way) and making it more entertaining than just me reading a bunch of boring theory to the viewer."
        },
        {
            "URL": "https://www.youtube.com/embed/FeZuPqXD3f0?version=3&vq=hd1080",
            "description": "Number 25, this is the video where I start to really take inspiration from skate VHS tapes. Thanks to azui for the voice clip in the intro, and the talentless XIM abuser getting shit on making for a nice clip at the end highlighting how dire the state of this game is in. Also of note I really, really like NOFX."
        },
        {
            "URL": "https://www.youtube.com/embed/lMnGPiNtXOA?version=3&vq=hd1080",
            "description": "Number 24, really starting to take editing more seriously with this video, but haven't really figured out the details with the style I want, also for the thumbnail this is where I installed Photoshop and started to really learn it. Overall good clips and I still really like the song."
        },
        {
            "URL": "https://www.youtube.com/embed/gs_TrH7ZKrE?version=3&vq=hd1080",
            "description": "Number 23, realized that clip dumps are basically the same thing as skate videos for zoomers and went from there. Thumbnail made in Inkscape as I refused to learn photoshop for years, so it ends up looking pretty bad, and I will probably remake it eventually to make it fit with the newer videos."
        },
        {
            "URL": "https://www.youtube.com/embed/mAyf3IvSmmA?version=3&vq=hd1080",
            "description": "Number 22, just a regular old clip dump, nothing special in terms of editing other than some basic syncs, and starting to use the Stay Down logos. Good clips though, some of the best wingman clips I've ever gotten even to this day. Every video uploaded prior to this is not very good in terms of clip quality and editing, so maybe don't watch them."
        }
    ]
}