{
    "videos": [
        {
            "URL": "https://www.youtube.com/embed/v-nBHHwylgM?version=3&vq=hd1080",
            "description": "Number 28, first video using a different damage filter, with the goal of making it look like a early 2000s video, something off a VX1000. Love the intro, and all my friends who were a part of it."
        }, 
        {
            "URL": "https://www.youtube.com/embed/WrNqD7bCBOg?version=3&vq=hd1080",
            "description": "Number 27, this one took a lot of time to make since I wanted to sync up the cuts with the scratching in the song, it came out very well and I’m super happy with the results. This will also be the last video using this VHS filter, since I think I’ve been using it for too long and it’s time to move on and find a new way to give my videos the texture I want."
        }, 
        {
            "URL": "https://www.youtube.com/embed/xbcln1ysQVA?version=3&vq=hd1080",
            "description": "Number 26, got very addicted to using the wingman for this video, not much special in the editing side of things, and looking back at it I probably could’ve used a better song. Still, decent clips and is up to my own standards."
        },
        {
            "URL": "https://www.youtube.com/embed/TLG32aIXjeQ?version=3&vq=hd1080",
            "description": "Not a frag video, but a guide going over basic 1v1 mechanics in Apex (principles mentioned covers all FPS games), tried to make it “in-universe” with the host (Who was AI, by the way) and making it more entertaining than just me reading a bunch of boring theory to the viewer."
        },
        {
            "URL": "https://www.youtube.com/embed/m8Mw5Xorz7M?version=3&vq=hd1080",
            "description": "Also not a frag video, but a stream highlight of me going against a pretty decent movement player, good example and application of aim strategy, and general good aim. I apologize for using the VHS filter on VODs."
        },
        {
            "URL": "https://www.youtube.com/embed/FeZuPqXD3f0?version=3&vq=hd1080",
            "description": "Number 25, this is the video where I start to really take inspiration from skate VHS tapes. Thanks to azui for the voice clip in the intro, and the talentless XIM abuser getting shit on making for a nice clip at the end highlighting how dire the state of this game is in. Also of note I really, really like NOFX."
        },
        {
            "URL": "https://www.youtube.com/embed/lMnGPiNtXOA?version=3&vq=hd1080",
            "description": "Number 24, really starting to take editing more seriously with this video, but haven't really figured out the details with the style I want, also for the thumbnail this is where I installed Photoshop and started to really learn it. Overall good clips and I still really like the song."
        },
        {
            "URL": "https://www.youtube.com/embed/gs_TrH7ZKrE?version=3&vq=hd1080",
            "description": "Number 23, realized that clip dumps are basically the same thing as skate videos for zoomers and went from there. Thumbnail made in Inkscape as I refused to learn photoshop for years, so it ends up looking pretty bad, and I will probably remake it eventually to make it fit with the newer videos."
        },
        {
            "URL": "https://www.youtube.com/embed/mAyf3IvSmmA?version=3&vq=hd1080",
            "description": "Number 22, just a regular old clip dump, nothing special in terms of editing other than some basic syncs, and starting to use the Stay Down logos. Good clips though, some of the best wingman clips I've ever gotten even to this day. Every video uploaded prior to this is not very good in terms of clip quality and editing, so maybe don't watch them."
        }
    ]
}